
## Terraform Testing: `terraform/accounts/czi-si`

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### [Terraform Plan](https://si.prod.tfe.czi.technology/app/shared-infra/jheath-test-acction/runs/run-Bf5kdbHoDYCPLRWT) 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://si.prod.tfe.czi.technology/app/shared-infra/jheath-test-acction/runs/run-Bf5kdbHoDYCPLRWT

Waiting for the plan to start...

Terraform v1.3.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.server will be created
  + resource "random_id" "server" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

Plan details:
* Pusher: @jakeyheath
* Action: `pull_request`
* Working Directory: `terraform/accounts/czi-si`
* Workflow: `.github/workflows/test-tf-plan.yml`
* Ref: `refs/pull/215/merge`
* SHA: `b41593986e1aa651f915481a4ebf2ebd4adb0328`
